cf/Catalogs/Ячейки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Ячейки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Склады</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Проход</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Секция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ярус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поддон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сортировка</Name>
					<Comment>наименование для сортировки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоЗонаПриемки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьАвтоматическоеРаспределение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/InformationRegisters/ПорядокЯчеек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПорядокЯчеек</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Вес</Name>
					<Comment>Вес для выдачи ячекйки в запросах</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидЯчейки</Name>
					<Comment>1 - проход, 2 - секция, 3 -ярус, 4 - поддон</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Catalogs/Ячейки/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Объект.Наименование = "Чуш";
		
	КонецЕсли;
	
	УстановитьОтборДинамическогоСписка();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборДинамическогоСписка()
	СортировкаЯчеек.Параметры.УстановитьЗначениеПараметра("ИмяПроход",Объект.Проход);
	СортировкаЯчеек.Параметры.УстановитьЗначениеПараметра("ИмяСекция",Объект.Секция);
	СортировкаЯчеек.Параметры.УстановитьЗначениеПараметра("ИмяЯрус",Объект.Ярус);
	СортировкаЯчеек.Параметры.УстановитьЗначениеПараметра("ИмяПоддон",Объект.Поддон);
КонецПроцедуры

&НаСервере
Процедура СоздатьНесуществующиеНаСервере()
	ПроверитьСоздатьПорядок(1,Объект.Проход);
	ПроверитьСоздатьПорядок(2,Объект.Секция);
	ПроверитьСоздатьПорядок(3,Объект.Ярус);
	ПроверитьСоздатьПорядок(4,Объект.Поддон);
	Элементы.СортировкаЯчеек.Обновить();
КонецПроцедуры

&НаСервере
Процедура ПроверитьСоздатьПорядок(ВидЯчейки,Имя)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПорядокЯчеек.Вес
	               |ИЗ
	               |	РегистрСведений.ПорядокЯчеек КАК ПорядокЯчеек
	               |ГДЕ
	               |	ПорядокЯчеек.ВидЯчейки = &ВидЯчейки
	               |	И ПорядокЯчеек.Имя = &Имя";
	Если ЗначениеЗаполнено(Имя) Тогда
		Запрос.УстановитьПараметр("ВидЯчейки",ВидЯчейки);
		Запрос.УстановитьПараметр("Имя",Имя);
		Если Запрос.Выполнить().Пустой() Тогда
			НовЗапись = РегистрыСведений.ПорядокЯчеек.СоздатьМенеджерЗаписи();
			НовЗапись.ВидЯчейки = ВидЯчейки;
			НовЗапись.Имя = Имя;
			НовЗапись.Вес = Прав("000"+Имя,3);
			НовЗапись.Записать();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНесуществующие(Команда)
	СоздатьНесуществующиеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РеквизитПриИзменении(Элемент)
	УстановитьОтборДинамическогоСписка();
КонецПроцедуры
